{
  "mbti_questions": [
    {
      "mbti_questions_text_1": "When I'm at a friend's birthday party and see someone standing alone, I usually go over and start a friendly chat to make them feel welcome.",
      "dimension": "E",
      "reverse": false
    },
    {
      "mbti_questions_text_2": "After spending a whole day with friends, I look forward to some quiet time alone at home to relax and recharge my energy.",
      "dimension": "E",
      "reverse": true
    },
    {
      "dimension": "E",
      "reverse": false,
      "mbti_questions_text_3": "During a group discussion at work, I often share my thoughts out loud as they come to me, rather than keeping them inside."
    },
    {
      "dimension": "E",
      "reverse": true,
      "mbti_questions_text_4": "I feel most comfortable and focused when I have long stretches of quiet time to work without interruptions."
    },
    {
      "dimension": "E",
      "reverse": false,
      "mbti_questions_text_5": "At family gatherings, I enjoy being the one who gets everyone laughing and involved in conversations."
    },
    {
      "dimension": "E",
      "reverse": false,
      "mbti_questions_text_6": "On Friday evenings, I'd rather join friends at a lively restaurant than spend the night quietly at home."
    },
    {
      "dimension": "E",
      "reverse": false,
      "mbti_questions_text_7": "During team brainstorming sessions, talking through ideas with others usually sparks my best creative thoughts."
    },
    {
      "dimension": "E",
      "reverse": true,
      "mbti_questions_text_8": "Even when a meeting topic is really interesting, after two hours I start feeling drained and ready to leave."
    },
    {
      "dimension": "E",
      "reverse": false,
      "mbti_questions_text_9": "At work, I usually speak up with my opinions during team meetings rather than waiting to be asked."
    },
    {
      "dimension": "E",
      "reverse": true,
      "mbti_questions_text_10": "When I need to discuss something important, I'd rather send a text or email than have a face-to-face conversation."
    },
    {
      "dimension": "E",
      "reverse": false,
      "mbti_questions_text_11": "While traveling on a bus or train, I often strike up conversations with fellow passengers."
    },
    {
      "dimension": "E",
      "reverse": true,
      "mbti_questions_text_12": "In group discussions, I prefer to listen quietly and only speak when someone directly asks for my input."
    },
    {
      "dimension": "E",
      "reverse": false,
      "mbti_questions_text_13": "When working on creative projects, I get more excited about ideas when I can brainstorm with a team rather than alone."
    },
    {
      "dimension": "E",
      "reverse": true,
      "mbti_questions_text_14": "For hobbies and free time activities, I usually choose things I can do by myself rather than in groups."
    },
    {
      "dimension": "E",
      "reverse": false,
      "mbti_questions_text_15": "I feel most energized when working on big projects that involve lots of collaboration with other people."
    },
    {
      "dimension": "E",
      "reverse": false,
      "mbti_questions_text_16": "During meetings, I often share my ideas right away, even if they're not fully formed yet."
    },
    {
      "dimension": "E",
      "reverse": false,
      "mbti_questions_text_17": "Networking events and meeting new business contacts usually leave me feeling excited rather than tired."
    },
    {
      "dimension": "E",
      "reverse": true,
      "mbti_questions_text_18": "After a busy week of social activities, I make sure to schedule quiet days to rest and recharge."
    },
    {
      "dimension": "E",
      "reverse": false,
      "mbti_questions_text_19": "When I'm feeling emotional about something, I usually talk it through with friends to help me understand my feelings."
    },
    {
      "dimension": "E",
      "reverse": false,
      "mbti_questions_text_20": "I find that having background noise like music or conversation actually helps me focus better on my work."
    },
    {
      "dimension": "E",
      "reverse": false,
      "mbti_questions_text_21": "I usually make new friends quickly and easily when I meet people in social situations."
    },
    {
      "dimension": "E",
      "reverse": true,
      "mbti_questions_text_22": "Noisy environments like busy coffee shops make it hard for me to concentrate on what I'm doing."
    },
    {
      "dimension": "E",
      "reverse": false,
      "mbti_questions_text_23": "I prefer studying or working in places with other people around, like cafes, rather than completely quiet rooms."
    },
    {
      "dimension": "E",
      "reverse": true,
      "mbti_questions_text_24": "I rarely share personal stories about myself unless someone specifically asks me about them."
    },
    {
      "dimension": "S",
      "reverse": false,
      "mbti_questions_text_25": "When learning a new skill, I prefer clear, step-by-step instructions that I can follow exactly."
    },
    {
      "dimension": "S",
      "reverse": true,
      "mbti_questions_text_26": "I get more excited about imagining future inventions and technologies than researching how current tools work."
    },
    {
      "dimension": "S",
      "reverse": false,
      "mbti_questions_text_27": "When making decisions, I rely heavily on facts and data that I can observe and measure."
    },
    {
      "dimension": "S",
      "reverse": true,
      "mbti_questions_text_28": "I often notice patterns and symbols in everyday things that other people might overlook."
    },
    {
      "dimension": "S",
      "reverse": false,
      "mbti_questions_text_29": "When trying to understand a new concept, concrete examples help me grasp it better than abstract theories."
    },
    {
      "dimension": "S",
      "reverse": true,
      "mbti_questions_text_30": "I get bored when conversations focus too long on small everyday details."
    },
    {
      "dimension": "S",
      "reverse": false,
      "mbti_questions_text_31": "I can clearly remember specific details like the smell of my grandmother's kitchen or the sound of rain on the roof."
    },
    {
      "dimension": "S",
      "reverse": true,
      "mbti_questions_text_32": "I often daydream about how the world might look ten years from now."
    },
    {
      "dimension": "S",
      "reverse": false,
      "mbti_questions_text_33": "I trust hands-on experience and what I've personally seen more than theories or speculation."
    },
    {
      "dimension": "S",
      "reverse": true,
      "mbti_questions_text_34": "I enjoy exploring \"what if\" scenarios and imagining different possibilities."
    },
    {
      "dimension": "S",
      "reverse": false,
      "mbti_questions_text_35": "I have a good memory for conversations and can usually remember exactly what people have said."
    },
    {
      "dimension": "S",
      "reverse": true,
      "mbti_questions_text_36": "I often find myself thinking about the deeper meaning behind people's words and actions."
    },
    {
      "dimension": "S",
      "reverse": false,
      "mbti_questions_text_37": "I prefer using methods that have been proven to work rather than trying new experimental approaches."
    },
    {
      "dimension": "S",
      "reverse": true,
      "mbti_questions_text_38": "I can easily connect ideas that seem unrelated and see how they fit together in a bigger picture."
    },
    {
      "dimension": "S",
      "reverse": false,
      "mbti_questions_text_39": "I notice small changes in my surroundings, like a new painting on the wall or someone's new haircut."
    },
    {
      "dimension": "S",
      "reverse": true,
      "mbti_questions_text_40": "Sometimes I get so caught up in my thoughts that I miss obvious details around me."
    },
    {
      "dimension": "S",
      "reverse": false,
      "mbti_questions_text_41": "When learning something new, I like to start with basic facts before moving to more complex theories."
    },
    {
      "dimension": "S",
      "reverse": true,
      "mbti_questions_text_42": "Artistic works that are abstract and imaginative appeal to me more than realistic paintings."
    },
    {
      "dimension": "S",
      "reverse": false,
      "mbti_questions_text_43": "I prefer using clear, direct language rather than fancy words or complicated expressions."
    },
    {
      "dimension": "S",
      "reverse": true,
      "mbti_questions_text_44": "I can often predict trends by noticing small changes and clues that others miss."
    },
    {
      "dimension": "S",
      "reverse": false,
      "mbti_questions_text_45": "I enjoy activities that involve using my hands and working with physical objects."
    },
    {
      "dimension": "S",
      "reverse": true,
      "mbti_questions_text_46": "I naturally think in creative ways, using comparisons and word pictures to express ideas."
    },
    {
      "dimension": "S",
      "reverse": false,
      "mbti_questions_text_47": "I focus more on what's happening right now than on distant future possibilities."
    },
    {
      "dimension": "S",
      "reverse": true,
      "mbti_questions_text_48": "I get more excited about exploring new ideas than perfecting things that already work well."
    },
    {
      "dimension": "T",
      "reverse": false,
      "mbti_questions_text_49": "When making important choices, I focus on logical reasons rather than how I feel about them."
    },
    {
      "dimension": "T",
      "reverse": true,
      "mbti_questions_text_50": "Sometimes I choose options based on caring about others, even when the facts point to a different choice."
    },
    {
      "dimension": "T",
      "reverse": false,
      "mbti_questions_text_51": "In conversations, I value being clear and accurate more than keeping everyone happy."
    },
    {
      "dimension": "T",
      "reverse": true,
      "mbti_questions_text_52": "I try to avoid arguments that might hurt people's feelings."
    },
    {
      "dimension": "T",
      "reverse": false,
      "mbti_questions_text_53": "When solving problems, I like to make lists of pros and cons to help me decide."
    },
    {
      "dimension": "T",
      "reverse": true,
      "mbti_questions_text_54": "I believe that doing the right thing for people is sometimes more important than being efficient."
    },
    {
      "dimension": "T",
      "reverse": false,
      "mbti_questions_text_55": "I'm willing to give honest feedback, even if it might sound harsh."
    },
    {
      "dimension": "T",
      "reverse": true,
      "mbti_questions_text_56": "Before giving criticism, I always consider how the other person might feel."
    },
    {
      "dimension": "T",
      "reverse": false,
      "mbti_questions_text_57": "I believe rules exist to make things fair for everyone."
    },
    {
      "dimension": "T",
      "reverse": true,
      "mbti_questions_text_58": "Sometimes being kind is more important to me than being completely right."
    },
    {
      "dimension": "T",
      "reverse": false,
      "mbti_questions_text_59": "In discussions, I think facts and evidence should be more important than personal experiences."
    },
    {
      "dimension": "T",
      "reverse": true,
      "mbti_questions_text_60": "I rely heavily on my gut feelings and instincts when making choices."
    },
    {
      "dimension": "T",
      "reverse": false,
      "mbti_questions_text_61": "I try to set aside my emotions when I need to think clearly about an issue."
    },
    {
      "dimension": "T",
      "reverse": true,
      "mbti_questions_text_62": "Sometimes caring too much about others' feelings makes it hard for me to make decisions."
    },
    {
      "dimension": "T",
      "reverse": false,
      "mbti_questions_text_63": "I admire people who think logically and consistently."
    },
    {
      "dimension": "T",
      "reverse": true,
      "mbti_questions_text_64": "I feel guilty when my choices might make other people unhappy."
    },
    {
      "dimension": "T",
      "reverse": false,
      "mbti_questions_text_65": "I enjoy exploring the basic principles and rules behind how things work."
    },
    {
      "dimension": "T",
      "reverse": true,
      "mbti_questions_text_66": "To keep the team working well together, I sometimes agree with ideas even if they don't seem logical to me."
    },
    {
      "dimension": "T",
      "reverse": false,
      "mbti_questions_text_67": "When judging results, I focus on numbers and measurements I can count."
    },
    {
      "dimension": "T",
      "reverse": true,
      "mbti_questions_text_68": "I trust my emotional reactions as good guides for making decisions."
    },
    {
      "dimension": "T",
      "reverse": false,
      "mbti_questions_text_69": "I can handle criticism objectively without taking it personally."
    },
    {
      "dimension": "T",
      "reverse": true,
      "mbti_questions_text_70": "I care more about people's well-being than about performance numbers."
    },
    {
      "dimension": "T",
      "reverse": false,
      "mbti_questions_text_71": "I see disagreements as chances to improve ideas rather than create conflict."
    },
    {
      "dimension": "T",
      "reverse": true,
      "mbti_questions_text_72": "To keep conversations friendly, I sometimes avoid pointing out mistakes."
    },
    {
      "dimension": "J",
      "reverse": false,
      "mbti_questions_text_73": "I like to set clear deadlines for my projects and stick to them."
    },
    {
      "dimension": "J",
      "reverse": true,
      "mbti_questions_text_74": "I prefer keeping my schedule flexible so I can decide what to do as I go."
    },
    {
      "dimension": "J",
      "reverse": false,
      "mbti_questions_text_75": "Before going on a trip, I plan out every detail of the itinerary in advance."
    },
    {
      "dimension": "J",
      "reverse": true,
      "mbti_questions_text_76": "I get excited when plans change unexpectedly and I have to adapt."
    },
    {
      "dimension": "J",
      "reverse": false,
      "mbti_questions_text_77": "Having unclear deadlines makes me feel anxious and uncomfortable."
    },
    {
      "dimension": "J",
      "reverse": true,
      "mbti_questions_text_78": "I think being flexible is often better than sticking to a strict schedule."
    },
    {
      "dimension": "J",
      "reverse": false,
      "mbti_questions_text_79": "I break big goals into smaller tasks with specific dates attached to them."
    },
    {
      "dimension": "J",
      "reverse": true,
      "mbti_questions_text_80": "I like to explore all the possibilities before making a final decision."
    },
    {
      "dimension": "J",
      "reverse": false,
      "mbti_questions_text_81": "I usually finish my work well before the deadline."
    },
    {
      "dimension": "J",
      "reverse": true,
      "mbti_questions_text_82": "I work best when priorities and tasks are constantly changing."
    },
    {
      "dimension": "J",
      "reverse": false,
      "mbti_questions_text_83": "I like making quick decisions so I can start taking action right away."
    },
    {
      "dimension": "J",
      "reverse": true,
      "mbti_questions_text_84": "I prefer to gather more information before making important decisions."
    },
    {
      "dimension": "J",
      "reverse": false,
      "mbti_questions_text_85": "Having clear processes and steps makes everything run more smoothly."
    },
    {
      "dimension": "J",
      "reverse": true,
      "mbti_questions_text_86": "Sometimes strict rules feel too limiting and unnecessary."
    },
    {
      "dimension": "J",
      "reverse": false,
      "mbti_questions_text_87": "I keep my workspace neat and organized so I can find things easily."
    },
    {
      "dimension": "J",
      "reverse": true,
      "mbti_questions_text_88": "I prefer spontaneous adventures over carefully planned activities."
    },
    {
      "dimension": "J",
      "reverse": false,
      "mbti_questions_text_89": "I use checklists and to-do lists to track my progress on tasks."
    },
    {
      "dimension": "J",
      "reverse": true,
      "mbti_questions_text_90": "I like to try things out and experiment before settling on a final plan."
    },
    {
      "dimension": "J",
      "reverse": false,
      "mbti_questions_text_91": "I set monthly goals for myself and regularly check on my progress."
    },
    {
      "dimension": "J",
      "reverse": true,
      "mbti_questions_text_92": "Making long-term commitments makes me feel uncomfortable."
    },
    {
      "dimension": "J",
      "reverse": false,
      "mbti_questions_text_93": "Having predictable daily routines gives me a sense of peace and security."
    },
    {
      "dimension": "J",
      "reverse": true,
      "mbti_questions_text_94": "I leave some extra time in my schedule for unexpected opportunities."
    },
    {
      "dimension": "J",
      "reverse": false,
      "mbti_questions_text_95": "I like to finish one task completely before starting something new."
    },
    {
      "dimension": "J",
      "reverse": true,
      "mbti_questions_text_96": "Having strict schedules sometimes feels like it crushes my creativity."
    }
  ]
}